Enums/ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеВДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОплатыТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЭтапыРаботыСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЭтапыРаботыСКандидатами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Утверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПриемеНаРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассмотрениеОтклика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботаЗавершена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияЭтаповРаботыСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияЭтаповРаботыСКандидатами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пройден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пропущен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РешениеОПриемеНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РешениеОПриемеНаРаботу</Name>
			<BasedOn>
				<xr:Item>Catalog.Кандидаты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПланОбученияСотрудников</xr:Item>
				<xr:Item>InformationRegister.ОбновлениеЗаданийАдаптацииУвольнения</xr:Item>
				<xr:Item>InformationRegister.МероприятияАдаптацииУвольненияПоДокументу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяПозиция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапланироватьПрограммуОбучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспытательныйСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованныйДоход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДистанционнаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплатыТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОплатыТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииВыполненияРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныеДанныеКандидата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Внешний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗапросДанныхДляОформленияНаРаботу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МероприятияАдаптацииУвольнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияАдаптацииУвольнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Comment>Плановый срок исполнения задачи</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрограммаОбучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУчебныхЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ПодборПерсоналаСобытия/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Обработчик подписки на событие ЗаполнитьНаборЗначенийДоступаВзаимодействияСПредметомКандидатом.
Процедура ЗаполнитьНаборЗначенийДоступаСПредметомКандидатом(НаборЗаписей, Отказ, Замещение) Экспорт
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(НаборЗаписей) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДоЗаписи = ОбщегоНазначенияБЗК.ЗначениеСвойства(НаборЗаписей.ДополнительныеСвойства, "СтарыйНабор");
	
	Если ДанныеДоЗаписи = Неопределено Тогда
		// БСП 3.1.10.441 не содержит свойства "СтарыйНабор" т.к. не адаптироана к 8.3.27 (работает только режиме замещения).
		Если НаборЗаписей.Отбор["Взаимодействие"].Использование = Ложь 
			Или Не ЗначениеЗаполнено(НаборЗаписей.Отбор.Взаимодействие.Значение) Тогда
			Возврат;
		КонецЕсли;
		ПредметДоЗаписи = НаборЗаписей.ДополнительныеСвойства.СтруктураЗаписи.Предмет;
		ПредметПослеЗаписи = ?(НаборЗаписей.Количество() > 0, НаборЗаписей[0].Предмет, Неопределено);
		ПредметИзменился = ПредметДоЗаписи <> ПредметПослеЗаписи;
		ПредметЯвляетсяКандидатом = ТипЗнч(ПредметДоЗаписи) = Тип("СправочникСсылка.Кандидаты")
			Или ТипЗнч(ПредметПослеЗаписи) = Тип("СправочникСсылка.Кандидаты");
		Если ПредметИзменился И ПредметЯвляетсяКандидатом Тогда
			УправлениеДоступом.ОбновитьНаборыЗначенийДоступа(НаборЗаписей.Отбор.Взаимодействие.Значение);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	НовыеСтроки = ?(РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение), Новый Массив, Неопределено);
	ДанныеПослеЗаписи = НаборЗаписей.Выгрузить(НовыеСтроки);
	
	ТаблицаИзменений = КоллекцииБЗК.СравнитьТаблицы(ДанныеДоЗаписи, ДанныеПослеЗаписи, "Взаимодействие");
	Для Каждого СтрокаТаблицы Из ТаблицаИзменений Цикл
		Взаимодействие = СтрокаТаблицы.Взаимодействие;
		Если СтрокаТаблицы.ВидИзмененияСтроки = -1 Тогда
			ПредметДоЗаписи = ДанныеДоЗаписи.Найти(Взаимодействие, "Взаимодействие").Предмет;
			ПредметПослеЗаписи = Null;
		ИначеЕсли СтрокаТаблицы.ВидИзмененияСтроки = 0 Тогда
			ПредметДоЗаписи = ДанныеДоЗаписи.Найти(Взаимодействие, "Взаимодействие").Предмет;
			ПредметПослеЗаписи = ДанныеПослеЗаписи.Найти(Взаимодействие, "Взаимодействие").Предмет;
		Иначе
			ПредметДоЗаписи = Null;
			ПредметПослеЗаписи = ДанныеПослеЗаписи.Найти(Взаимодействие, "Взаимодействие").Предмет;
		КонецЕсли;
		ПредметИзменился = ПредметДоЗаписи <> ПредметПослеЗаписи;
		ПредметЯвляетсяКандидатом = ТипЗнч(ПредметДоЗаписи) = Тип("СправочникСсылка.Кандидаты")
			Или ТипЗнч(ПредметПослеЗаписи) = Тип("СправочникСсылка.Кандидаты");
		Если ПредметИзменился И ПредметЯвляетсяКандидатом Тогда
			УправлениеДоступом.ОбновитьНаборыЗначенийДоступа(Взаимодействие);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьРаботуСКандидатомПриИзмененииКадровойИстории(НаборЗаписейКадровойИстории, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(НаборЗаписейКадровойИстории) Тогда
		Возврат;
	КонецЕсли;
	
	Если НаборЗаписейКадровойИстории.Количество() = 0
		Или РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	// Если изменение кадровой истории - это прием на работу, нужно найти кандидата и отметить у него соотв. состояние
	// - если принят на работу - состояние "пройден"
	// - если не принят (отмена приема на работу) - состояние "пустое"
	
	ИзменившиесяДанныеКадровойИстории = НаборЗаписейКадровойИстории.ТаблицаИзменившихсяДанныхНабора();
	Если ИзменившиесяДанныеКадровойИстории = Неопределено Или ИзменившиесяДанныеКадровойИстории.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПриемНаРаботуСотрудников = Новый Соответствие;
	
	Для Каждого Изменение Из ИзменившиесяДанныеКадровойИстории Цикл
		Если Изменение.Добавление И Изменение.НовоеЗначениеВидСобытия = Перечисления.ВидыКадровыхСобытий.Прием Тогда
			ПриемНаРаботуСотрудников.Вставить(Изменение.Сотрудник, ОписаниеЭтапаПриемНаРаботу(Истина, Изменение.Период));
		КонецЕсли;
		Если Изменение.Удаление И Изменение.СтароеЗначениеВидСобытия = Перечисления.ВидыКадровыхСобытий.Прием Тогда
			ПриемНаРаботуСотрудников.Вставить(Изменение.Сотрудник, ОписаниеЭтапаПриемНаРаботу(Ложь));
		КонецЕсли;
	КонецЦикла;
	
	Если ПриемНаРаботуСотрудников.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КандидатыПоСотрудникам = ПодборПерсонала.КандидатыПоСотрудникам(
		ОбщегоНазначения.ВыгрузитьКолонку(ПриемНаРаботуСотрудников, "Ключ"));
	
	Регистраторы = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(НаборЗаписейКадровойИстории, Замещение, "Регистратор");
	Если Регистраторы.Количество() <> 0 Тогда
		Регистратор = Регистраторы[0];
	Иначе
		Регистратор = Неопределено;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из КандидатыПоСотрудникам Цикл
		Результат = ПодборПерсоналаКлиентСервер.РезультатУстановкиЭтапаРаботыСКандидатом();
		Результат.Кандидаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаТаблицы.Кандидат);
		Результат.ЭтапРаботы.Этап = Перечисления.ЭтапыРаботыСКандидатами.ПриемНаРаботу;
		ОписаниеЭтапа = ПриемНаРаботуСотрудников.Получить(СтрокаТаблицы.Сотрудник);
		Если ОписаниеЭтапа.Принят Тогда
			Результат.ЭтапРаботы.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден;
			Результат.ЭтапРаботы.Период = Перечисления.ЭтапыРаботыСКандидатами.УточнитьВремяЭтапа(
				Перечисления.ЭтапыРаботыСКандидатами.ПриемНаРаботу, ОписаниеЭтапа.ДатаПриема);
			Результат.ЭтапРаботы.ДокументОснование = Регистратор;
		КонецЕсли;
		ПодборПерсонала.УстановитьСостояниеЭтапаРаботыКандидатов(Результат);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьРаботуСКандидатомПриИзмененииРешенияОПриемеНаРаботу(ДокументОбъект, Отказ) Экспорт

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ДокументОбъект) Тогда
		Возврат;
	КонецЕсли;

	Кандидаты = Новый Массив;
	
	ПрежниеДанные = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДокументОбъект.ДополнительныеСвойства, "ПрежниеДанные", Новый Структура);

	Если Не ПрежниеДанные.Свойство("Кандидат") Тогда
		Кандидаты.Добавить(ДокументОбъект.Кандидат);
	ИначеЕсли ПрежниеДанные.Кандидат <> ДокументОбъект.Кандидат Тогда
		Кандидаты.Добавить(ПрежниеДанные.Кандидат);
		Кандидаты.Добавить(ДокументОбъект.Кандидат);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПрежниеДанные, "Проведен", Ложь) <> ДокументОбъект.Проведен Тогда
		Кандидаты.Добавить(ДокументОбъект.Кандидат);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПрежниеДанные, "Комментарий", Ложь) <> ДокументОбъект.Комментарий Тогда
		Кандидаты.Добавить(ДокументОбъект.Кандидат);
	КонецЕсли;

	Если Кандидаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	РешенияПоКандидатам = Документы.РешениеОПриемеНаРаботу.РешенияПоКандидатам(Кандидаты);
	ДанныеРешений = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		ОбщегоНазначения.ВыгрузитьКолонку(РешенияПоКандидатам, "Значение"), "Дата, Проведен, Комментарий");
	Для Каждого Кандидат Из Кандидаты Цикл
		Результат = ПодборПерсоналаКлиентСервер.РезультатУстановкиЭтапаРаботыСКандидатом();
		Результат.Кандидаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Кандидат);
		Результат.ЭтапРаботы.Этап = Перечисления.ЭтапыРаботыСКандидатами.РешениеОПриемеНаРаботу;
		Решение = РешенияПоКандидатам[Кандидат];
		Если ЗначениеЗаполнено(Решение) Тогда
			Если ДанныеРешений[Решение].Проведен Тогда
				Результат.ЭтапРаботы.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден;
			Иначе
				Результат.ЭтапРаботы.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован;
			КонецЕсли;
			Результат.ЭтапРаботы.Период = Перечисления.ЭтапыРаботыСКандидатами.УточнитьВремяЭтапа(
				Перечисления.ЭтапыРаботыСКандидатами.РешениеОПриемеНаРаботу, ДанныеРешений[Решение].Дата);
			Результат.ЭтапРаботы.Комментарий = ДанныеРешений[Решение].Комментарий;
			Результат.ЭтапРаботы.ДокументОснование = Решение;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		ПодборПерсонала.УстановитьСостояниеЭтапаРаботыКандидатов(Результат);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;
	
КонецПроцедуры

// Обработчик подписки на событие ЗарегистрироватьИзменениеФизическихЛицКандидатовДляПерсональныхДанных.
// 
// Параметры:
// 	Источник - РегистрСведенийНаборЗаписей.ПредметыПапкиВзаимодействий - 
// 	Отказ - Булево
// 	Замещение - Булево
Процедура ЗарегистрироватьИзменениеФизическихЛицКандидатовДляПерсональныхДанныхПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗащитаПерсональныхДанных.ИспользоватьУничтожениеПерсональныхДанныхСубъектов() Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Количество() = 0 Или РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	ПодборПерсонала.ДобавитьСубъектыДляРасчетаСроковХранения(Источник);
	
КонецПроцедуры

// Параметры:
//  Принят - Булево
//  ДатаПриема - Дата, Неопределено -
// 
// Возвращаемое значение:
//  Структура:
// * Принят - Булево - 
// * ДатаПриема - Дата, Неопределено - 
Функция ОписаниеЭтапаПриемНаРаботу(Принят, ДатаПриема = Неопределено)
	
	Описание = Новый Структура();
	Описание.Вставить("Принят", Принят);
	Описание.Вставить("ДатаПриема", ДатаПриема);
	
	Возврат Описание;

КонецФункции

#КонецОбласти
